// newsItem.js
var util = require('../../utils/util.js');
var app = getApp();
Page({

  /**
   * 页面的初始数据
   */
  data: {
    NID: '',
    TXT: '',
    BGURL: 'https://www.yondo.cc/wx/images/101.png',
    BSURL: '',
    PAGE: "NEWS_ITEM",
    imagewidth: 0,
    imageheight: 0,
    NODES: []
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.setNavigationBarTitle({
      title: options.txt
    })
    //调用应用实例的方法获取全局数据
    this.setData({
      NID: options.id,
      TXT: options.txt,
      //BGURL: options.url,
      // BSURL: app.globalData.bseurl,
      NODES: [""]
    })
    if (options.id == "item-1") {
      this.setData({
        NODES: [
          { INFO_CONTENT: "１。必要的背诵记忆是必须的，否则是无法学好法律的，特别要形成相应的法言法语才行；" }
          , { INFO_CONTENT: "２。重点科目有法理、宪法、行政法、民法、刑法、诉讼法、国际法等；" }
          , { INFO_CONTENT: "３。难点是法理和法条的记忆。" }]
      })
    } else if (options.id == "item-2") {
      this.setData({
        NODES: [
          { INFO_CONTENT: "2017年司法考试备考应注意的五大问题" }
          , { INFO_CONTENT: "很多朋友踏上了2017年司考备战的征程，越走越远，只留下一个个模糊的背影。不由让我回想起了自己的司法考试备考的往事。回望那段来时的路，感慨颇多。不过总结起来，正是因为做好的应该做的事情，才造就了我最后的胜利！下面我就和大家分享一下自己的备考心得，希望能对大家有所帮助。" }
          , {
            INFO_CONTENT: "一、应保证复习时间 我们必须保证平均每天8个小时的复习时间。对于上班族来说，白天的上午下午分别挤出一两个小时（很多地方还可以专门请假1月，那就更好了），晚上下班回家后拿出五六个小时应该可以吧。可以理解的是作为大部分人，很难做到把精力一直集中在司考复习这么枯燥的事情上来。我们现在不管精力是否集中，都要强迫自己一直在看书复习，8个小时之中，有4到5个小时的时间能够沉浸其中，起到作用就行了。另外我还教大家一个充分利用时间的方法，即在上班、出差等途中听听mp3巩固一下。既能解闷，又能学到东西，一举两得。" }
          , {
            INFO_CONTENT: "二、应注意知识梳理 我认为复习应以教材为主，虽然有些人反对，但是我认为复习以教材为主适合绝大部分人。我提倡复习教材的方法是快速循环复习法，这样有助于巩固记忆。但是，我们看教材不能仅仅盲目、死板、机械的一遍遍的看，我们在看第一遍时可以不必要求系统什么的，但是后来再看教材，我们必须注意知识点之间的相互关联、区别等等，必须要在大脑中对司考考察内容有一个总体框架，对每个部门法也要有一个小的思维框架，纲举目张，举一反三就是对我们复习方法的概括和要求。复习中要形成记笔记的好习惯，要多注意知识点的归纳整理。我们要利用笔记理清容易混淆知识点之间的区别。" }
          , {
            INFO_CONTENT: "三、应正确处理劳逸 大家看到这个肯定认为我主要是提倡大家复习中要注意休息，其实不然，我认为复习中“逸”只是很次要的，因为这个时候的时间很宝贵，不容许我们更多的“逸”。我也不是不让大家休息，不能因为劳逸结合导致复习三天打鱼两天晒网。复习时不要给自己太多的压力，只要做到复习有计划性就行了，如可以每天给自己规定看多少页书，做多少道题等等，这样可以使复习有条不紊的进行，避免心情急躁或者劳累过度。另外关于注意营养等问题我就不多说了，这个大家应该都比较清楚。" }
          , {
            INFO_CONTENT: "四、应选择高质量的辅导班 现在各路辅导班遍地开花，各种广告许诺天花乱坠。许多考生都是在职人员，平时复习时间很少，于是有人就想能有一条能投入时间少效果明显的捷径，辅导班这个时候就成为大家的首选。我在这里不是完全否定培训班的作用，仅仅从他对考试所起的作用来看还是有的，把能够帮助考生理清思路、掌握重点。但是我们大部分人都是带着一种投机取巧的心理入班的，平时基本功不扎实，妄图通过辅导班的恶补来填充，这其实只是一个误区，只会更加浪费时间。司考的成功必须是建立自身的努力上的，离开这一点，你根本不可能成功。" }
          , {
            INFO_CONTENT: "五、应注意临考调整 考试的日子是我们出成绩的两天，不管你以前复习的多么用功多么扎实，如果把握不好这两天，同样是前功尽弃。我们参加司考的都是成年人，心理素质肯定都差不多，一般不会出现中高考那样承受不住压力的情况，但是在考前和考中的细节也必须处理好。考前的准备工作自然要做好，文具等要多备几套这个大家也不能马虎，还有今年关于第四卷答题特别说明也要按照要求重视起来。在考前一个星期我们就要开始注意休息，不能过于劳累，要调节好身体的各项机能。司考，自信很关键，我们不要太过于高看司考，你把他看作仅仅是一个考察文字基础记忆的东西就行了，只要你的死工夫下到了就ok了。“司考不过是一场考试而已！”。有些人主张在考试前一天或者进考场前，都不要再在看书了，这种观点我不赞成。俗话说临阵磨枪不快也光，在考前一天抓紧把一些死记硬背的东西（如法制史、宪法等）再翻看一遍好处是很大的。另外进考场前翻翻书的意义不在于你能记住多少东西上，它主要起到一个稳定情绪的作用，这主要适合一些在考前总在考虑我这个没有记住那个没有记牢的人，随便翻翻书可以稳定情绪增加自信。" }
          , { INFO_CONTENT: "外国人在中朋友们，既然我们选择了一条注定不会平坦的路，就让我们竭尽全力做好我们能够做，而且应该做的吧！祝大家2017年司法考试一切顺利！国领域内犯罪" }]
      })
    }
    else if (options.id == "item-3") {
      this.setData({
        NODES: [
          { INFO_CONTENT: "外国人在中国领域内犯罪" }
          , { INFO_CONTENT: "[案情]   被告人:某甲,男,33岁,前苏联人,副驾驶员。   1985年12月19日,被告人某甲与机长某乙等机组人员,在原苏联境内驾驶47845号安一24型民航客机,执行某市民航局101/435航班任务。当飞机飞到东经118。09’00\", 北纬52。40’00”上空时, 被告人趁领航员上厕所之机, 以机舱出机械故障为由, 将机械师骗出驾驶舱, 随即锁上驾驶舱门, 扭动自动驾驶仪, 持刀威逼驾驶飞机的机长某乙向中国方向飞行, 机长被迫改变航向, 19日14时30分许, 该机降落在我国黑龙江省某县某乡农田里。" }
          , { INFO_CONTENT: "[问题]   某甲在我国领域内犯罪是否适用我国刑法?" }
          , { INFO_CONTENT: " [判决]       法院判决认为, 被告人某甲以暴力手段劫持飞行中的民用航空器, 飞入我国境内, 其行为危害了公共安全, 构成了犯罪, 应依照中国刑法论处。" }
          , { INFO_CONTENT: "[法理分析]       本案涉及我国刑法的空间效力问题, 被告人某甲虽是外国人, 但我国司法机关有权对其犯罪行为行使司法管辖权。因为: 第一, 某甲劫持航空器, 已违反我国参加的《东京公约》、《海牙公约》和《蒙特利尔公约》的通知规定, “如发生外国飞机被劫持在我国降落等有关涉外事件, 应按我国法律, 并结合上述三个公约的有关规定处理”,同时符合我国《刑法》第九条所规定的中国应承担条约义务的范围内, “对于中华人民共和国缔结或者参加的国际条约所规定的罪行, 中华人民共和国在所承担条约义务的范围内行使刑事管辖权的, 适用本法。”" }
          , { INFO_CONTENT: "第二, 我国《刑法》第6条第13款规定: “凡在中华人民共和国领域内犯罪的、除法律有特别规定的以外, 都适用本法。”“犯罪的行为或者结果有一项发生在中华人民共和国领域内的, 就认为是在中华人民共和国领域内犯罪。”某甲不是享有外交特权和豁免权的外国人, 有关刑事责任问题, 不需要通过《刑法》第11条之规定解决, “享有外交特权和豁免权的外国人的刑事责任问题, 通过外交途径解决”,即不属于“法律有特别规定的”, 情况, 某甲的犯罪行为虽始于我国领域之外, 但其犯罪结果却发生在我国领域以内, 依照我国的有关规定, 属于我国领域内犯罪, 所以, 应适用我国刑法, 依法追究其刑事责任。" }]
      })
    }

    // Post.call(this, this, "LOAD", null, function (that, data) {
    //   that.setData({
    //     NODES: data.NODES
    //   })
    // });
  },
  imageLoad: function (e) {
    var imageSize = util.imageUtil(e)
    this.setData({
      imagewidth: imageSize.imageWidth,
      imageheight: imageSize.imageHeight
    })
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
    // Post.call(this, this, "LOAD", jsPost, function (that, data) {
    //   that.setData({
    //     NODES: data.NODES
    //   })
    // });
    wx.stopPullDownRefresh()
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    var that = this
    return {
      title: that.data.TXT,
      desc: '',
      path: '/pages/docs/doc_view?id=' + that.data.NID + '&txt=' + that.data.TXT + '&url=' + that.data.BGURL
    }
  }
})


//服务器请求数据
function Post(that, action, data, doAfter) {
  //数据请求执行方法
  var jsPost = data || new util.jsonRow()
  jsPost.AddCell("NID", that.data.NID)
  util.Post(that, action, jsPost, function (that, res) {
    if (res) {
      //回调
      typeof doAfter == "function" && doAfter(that, res)
    }
    else {
      // console.log('error')
    }
  })
}
